// $('body').hide()
function smoothScroll(targetId) {
  const targetElement = document.getElementById(targetId);
  targetElement.scrollIntoView({ behavior: 'smooth' });
  
  // Highlight the target element
  targetElement.classList.add('highlight');

  // Remove the highlight after 0.5 seconds
  setTimeout(() => {
      targetElement.classList.remove('highlight');
  }, 500);
}
		  function showFullNews() {
			document.getElementById('overlay').style.display = 'flex';
		  }
		
		  function hideFullNews() {
			document.getElementById('overlay').style.display = 'none';
		  }

          window.onscroll = function() {scrollFunction()};

          function scrollFunction() {
            var scrollToTopButton = document.querySelector('.scroll-to-top');
            if (document.body.scrollTop > 20 || document.documentElement.scrollTop > 20) {
              scrollToTopButton.classList.add('show');
            } else {
              scrollToTopButton.classList.remove('show');
            }
          }
        
          function scrollToTop() {
            document.body.scrollTop = 0;
            document.documentElement.scrollTop = 0;
          }


          function openContactModal() {
            document.getElementById('contactModal').style.display = "block";
            fillContactModalContent();
        }
        
        function closeContactModal() {
            document.getElementById('contactModal').style.display = "none";
        }
        
        function fillContactModalContent() {
            const modalContent = `
                <div class="contact-info">
                    <div class="contact-column">
                        <h3>Присоединяйтесь:</h3>
                        <p>Соц. сети:</p>
                        <p><a href="https://vk.com/tmbstu">https://vk.com/tmbstu</a></p>
                        <p><a href="https://t.me/tmbstu">https://t.me/tmbstu</a></p>
                        <p>Помощь по вопросам поступления:</p>
                        <p>Email: <a href="mailto:help@tstu.ru">help@tstu.ru</a></p>
                        <p>Адрес:</p>
                        <p>392000, г. Тамбов, ул. Советская, д. 106/5, помещение 2</p>
                        <p>Телефон: (4752) 63-10-19</p>
                        <p>Факс: 63-06-43</p>
                        <p>Email: <a href="mailto:delo@tstu.ru">delo@tstu.ru</a></p>
                    </div>
                    <div class="contact-column">
                        <h3>Банковские реквизиты ФГБОУ ВО "ТГТУ":</h3>
                        <p>ИНН 6831006362 КПП 682901001</p>
                        <p>Получатель: УФК по Тамбовской области (ФГБОУ ВО «ТГТУ» л/с 20646U94430)</p>
                        <p>Счет Получателя: 03214643000000016400</p>
                        <p>Банк получателя: Отделение Тамбов Банка России//УФК по Тамбовской области г. Тамбов</p>
                        <p>Счет банка получателя: 40102810645370000057</p>
                        <p>БИК 016850200</p>
                        <p>КБК 00000000000000000130 - для перечислений от реализации работ, услуг</p>
                        <p>КБК 00000000000000000150 - для целевых перечислений (пожертвований, стипендий и т.д.)</p>
                        <p>Код по ОКПО 02069289</p>
                        <p>ОКТМО 68701000</p>
                        <p>ОГРН 1026801156557</p>
                        <p>ОКВЭД 85.22.</p>
                    </div>
                </div>`;
            
            document.getElementById('contactModalContent').innerHTML = modalContent;
        }
        


         // изображения слайдера
  const images = [
    'img/lecture-hall.jpg',
    'img/lecture-hall.jpg',
    'img/lecture-hall.jpg',
    'img/lecture-hall.jpg',
    'img/img/y3HdQ0oNLRY.jpg'
  ];

  let currentSlide = 0;
  const sliderContainer = document.querySelector('.slider');
  const sliderNav = document.querySelector('.slider-nav');

  
  function initSlider() {
  
    sliderNav.innerHTML = '';

    //создаёт кнопки навигации 
    images.forEach((_, index) => {
      const navButton = document.createElement('div');
      navButton.classList.add('slider-nav-button');
      navButton.classList.toggle('active', index === currentSlide);
      navButton.onclick = () => {
        goToSlide(index);
      };
      sliderNav.appendChild(navButton);
    });

    updateSlider();
  }

  // переход к определённому слайду
function goToSlide(index) {
  const slides = sliderContainer.querySelectorAll('img');
  slides.forEach((slide, i) => {
    slide.classList.remove('prev', 'active', 'next');
    if (i === currentSlide) {
      slide.classList.add('prev');
    }
    if (i === index) {
      slide.classList.add('active');
    }
    if (i === (index + 1) % images.length) {
      slide.classList.add('next');
    }
  });
  currentSlide = index;
  updateNavButtons();
}

  // делает так, чтобы кнопки слайдера обновлялись 
  function updateNavButtons() {
    const navButtons = sliderNav.querySelectorAll('.slider-nav-button');
    navButtons.forEach((button, i) => {
      button.classList.toggle('active', i === currentSlide);
    });
  }

  // переключение слайдов
  function nextSlide() {
    const nextIndex = (currentSlide + 1) % images.length;
    goToSlide(nextIndex);
  }

  setInterval(nextSlide, 10000);

  // Инициализация слайдера
  initSlider();

  // Modal functions
  function openModal(id) {
    document.getElementById(id).style.display = 'flex';
  }

  function closeModal(id) {
    document.getElementById(id).style.display = 'none';
  }

  //пролистывание вверх
  function scrollToTop() {
    window.scrollTo({ top: 0, behavior: 'smooth' });
  }

  // Show scroll-to-top button on scroll
  window.onscroll = function() {
    const scrollToTopBtn = document.getElementById('scrollToTopBtn');
    if (document.body.scrollTop > 100 || document.documentElement.scrollTop > 100) {
      scrollToTopBtn.classList.add('show');
    } else {
      scrollToTopBtn.classList.remove('show');
    }
  };

//   function loadMoreNews() {
//     const newsContainer = document.getElementById('newsContainer');
//     const newNews = [
//         {
//             title: "Заголовок третьей новости",
//             date: "26 мая 2024",
//             description: "Краткое описание третьей новости, которое привлекает внимание к её содержанию."
//         },
//         {
//             title: "Заголовок четвёртой новости",
//             date: "25 мая 2024",
//             description: "Краткое описание четвёртой новости, которое привлекает внимание к её содержанию."
//         },
//         {
//             title: "Заголовок пятой новости",
//             date: "24 мая 2024",
//             description: "Краткое описание пятой новости, которое привлекает внимание к её содержанию."
//         }
//     ];

//     newNews.forEach(news => {
//         const newsItem = document.createElement('div');
//         newsItem.className = 'news-item';
//         newsItem.setAttribute('onclick', `openModal('${news.id}')`);
//         newsItem.innerHTML = `
//             <h3>${news.title}</h3>
//             <p class="date">${news.date}</p>
//             <p>${news.description}</p>
//         `;
//         newsContainer.appendChild(newsItem);
//     });

//     const loadMoreButton = document.querySelector('.load-more');
//     loadMoreButton.style.display = 'none';
// }
function loadMoreNews() {
  const newsContainer = document.getElementById('newsContainer');
  const newNews = [
      {
          title: "Проекты студентов ТГТУ стали победителями грантового конкурса Росмолодёжи",
          date: "26 мая 2024",
          description: "В середине мая были подведены итоги всероссийского конкурса Федерального агентства по делам молодежи «Росмолодежь.Гранты». От Тамбовского государственного технического университета было поддержано 3 проекта на сумму около 1,5 миллионов рублей.",
          id: "news3"
      },
      {
          title: "30 лет Факультету международного образования ТГТУ",
          date: "24 мая 2024",
          description: "На прошлой неделе команда сотрудников университета приняла участие в 48 областном туристическом слете-семинаре работников образовательных организаций, который проходил на берегу реки Большая Липовица в Знаменском муниципальном округе.",
          id: "news4"
      },
      {
          title: "Для выпускников Политехнического лицея ТГТУ прошел праздник Последнего звонка",
          date: "24 мая 2024",
          description: "24 мая в главном корпусе Тамбовского государственного технического университета прошла торжественная церемония, посвященная Последнему звонку в Политехническом лицее.",
          id: "news5"
      }
  ];

  newNews.forEach(news => {
      const newsItem = document.createElement('div');
      newsItem.className = 'news-item';
      newsItem.setAttribute('onclick', `openModal('${news.id}')`);
      newsItem.innerHTML = `
          <h3>${news.title}</h3>
          <p class="date">${news.date}</p>
          <p>${news.description}</p>
      `;
      newsContainer.appendChild(newsItem);
  });

  const loadMoreButton = document.querySelector('.load-more');
  loadMoreButton.style.display = 'none';
}

function openModal(newsId) {
  const modal = document.getElementById('myModal');
  const modalText = document.getElementById('modalText');
  const newsContent = {
      news1: 'Исследовательско-коммуникационная платформа «Неравнодушный человек» создана для организованных сообществ с целью повышения эффективности взаимодействия и накопления социального капитала участников. Она разработана на основе высокотехнологичных исследований, анализа и обработки больших данных, современных психологических инструментов и методик.В рамках квиза ребята узнали, как социологические исследования влияют на общественные и государственные решения.Места распределились следующим образом: 1 место - команда «Два студента-суслика»; 2 место - команда «Девять беспризорников»; 3 место - команда «Семья». Специальные призы за победу в розыгрыше «Неравнодушный репост» получила Анастасия Кухта и за победу в розыгрыше «Поиск по тегу» Анастасия Егорова.',
      news2: '«Это важное событие — праздник для всех, кто участвовал в становлении и развитии компании, способствовал укреплению её позиций в отрасли. Такой успех стал возможен благодаря бережному сохранению и развитию традиций, творческому и систематическому применению накопленного опыта. Во все времена предприятие успешно реализовывало проекты по реконструкции и модернизации производства, выполняя все задачи в установленные сроки. Пусть эта юбилейная дата станет отправной точкой для новых масштабных проектов, основанных на приобретённом опыте и последних научных достижениях. Уверен, ваша сплочённость и профессионализм позволят успешно реализовать новые идеи компании и обеспечат стабильное развитие, ведь главные заслуги предприятия принадлежат высококвалифицированным специалистам, нацеленным на максимальный результат и соответствие мировым стандартам качества. Благодарю Вас и весь коллектив АО «ПИГМЕНТ» за сотрудничество с Тамбовским государственным техническим университетом в области научных исследований и подготовки кадров для химической промышленности. Многие наши выпускники успешно работают на Вашем предприятии, студенты проходят здесь практику, а затем находят работу и строят карьеру. Уверен, наше взаимодействие будет продолжаться и способствовать развитию химической отрасли региона», - отметил Михаил Николаевич.На празднике глава региона Максим Егоров вручил заводчанам награды и благодарности за выдающиеся успехи и добросовестный труд. Многие работники предприятия - выпускники ТГТУ.В преддверии юбилея на производственной территории «Пигмент» состоялось официальное открытие нового заводского сквера, в котором приняла участие первый проректор ТГТУ Наталия Молоткова.Сквер разместился на площади три гектара и состоит из трех зон: исторической, молодежной и для сценических выступлений. Основными точками притяжения на территории являются 25 стендов и 9 столов-стендов, а также тематические арт-объекты и топиарные фигуры. Участие в разработке проекта принимали студенты Института архитектуры, строительства и транспорта ТГТУ. ',
      news3: 'Всего было подано 2 575 заявки от 285 учебных заведений на конкурс Росмолодёжь.Гранты среди вузов в 2024 году. По результатам конкурса 3 проекта от студентов ТГТУ, стали победителями на общую сумму 1 447 443 рублей.Аспирантка ТГТУ Екатерина Николюкина выступила с проектом поддержки и развития студенческой молодежи «Университет возможностей». Он направлен на обучающихся 10-11 классов, 1-4 курсов среднего и высшего образования в возрасте от 16 до 25 лет. Для ребят будет проведен комплекс мероприятий, включающих в себя: создание зоны для психологической разгрузки; оказание индивидуальной консультативной помощи при возникновении различного рода проблем; проведение мастер-классов, направленных на личностное развитие молодежи; проведение круглого стола со студентами и психологами Тамбова на тему “Оказание допсихологической помощи молодежи как современной формы поддержки формирования и развития способностей у молодежи”; выявление и поддержка талантливой молодежи через командное взаимодействие, направленных на преодоление психологических барьеров в вузовской среде. Проект направлен на решение проблемы недостатка психологического подхода к адаптации студентов на входе в среду высшего образования и выходе из него.«Эмоции от победы в грантовом конкурсе только самые приятные. Этот проект зарождался уже давно, но всегда чего-то не хватало. И вот наша команда нашла золотую середину, которая привела наш проект к победе. Мы расширяем университетскую программу адаптации для студентов первого курса и помимо наших традиционных активностей мы предложим первокурсникам групповые встречи с психологами на темы психологической адаптации и преодолению барьеров от перехода из среды школы в вуз», - рассказала Екатерина.Аспирант Дмитрий Луцков предложил проект «Фестиваль современной этномоды «Край родной». Он будет реализовываться в период с июня 2024 года по ноябрь 2024 года. В течение 10 дней участники проекта пройдут обучение: посетят круглый стол, мастер-класс и лекции на тему создания этнокостюма, что позволит им в рамках проекта самостоятельно создать собственную коллекцию к конкурсному показу. В целях патриотического воспитания и культурно-творческого развития молодежи будут организованы мероприятия, которые помогут осознать истинную ценность этномоды как элемента народной культуры: круглые столы, лекции, мастер-классы. Участники получат практические навыки создания этнокостюма и сформируют понятие о важности передачи опыта и культурной смены поколений. Большая информационная компания позволит привлечь внимание молодежи к аспектам сохранения традиций и пробудить интерес к истории создания этнокостюма. По итогам работы проекта будут составлены методические указания по самостоятельному созданию коллекции этномоды «От идеи к воплощению»."Победа в гранатовом конкурсе у меня вызывает много различных эмоций. Во-первых, это ощущение гордости и удовлетворения от того, что мы смогли преодолеть сложности и достичь поставленной цели. Также возникает радость и эйфория от того, что ты стал победителем и получил приз или признание за свои усилия. Ведь наша команда, наш Театр мод уже на протяжении 11 лет занимается и развивает этномоду и студенческий подиум у нас в области", - рассказал Дмитрий.Студентка Института энергетики, приборостроения и радиоэлектроники Екатерина Дудина представила проект «Студенческий центр работающей молодежи»: «Наш проект нацелен на трудоустройство молодежи региона на рабочие места предприятий Тамбовской области в надежде, что снизится отток местных молодых специалистов в соседние города-миллионники. В проекте «Студенческий центр работающей молодежи» планируется участие более 100 молодых людей Тамбовской области от 18 до 35 лет, являющихся студентами Тамбовского государственного технического университета. В рамках проекта пройдёт ряд мероприятий по вовлечению, профориентации и самореализации молодых людей. Участники проекта смогут бесплатно пройти профессиональное обучение и получить рабочее место в летний период времени на предприятиях, реализующих проекты импортозамещения с последующим шансом трудоустройства на постоянной основе. Мы хотим, чтобы Центр работал ежегодно, создавая мост между новыми востребованными рабочими местами региона и молодежью. К концу 2030 года планируется, что через Центр пройдёт более 1000 студентов, что заметно отразится на результатах долгосрочной программы содействия занятости молодежи на период до 2030 года, утверждённой распоряжением Правительства Российской Федерации, и показателях дополнительных мер, направленных на снижение занятости труда. Мы ожидаем, что Центр будет оказывать индивидуальную консультацию по вопросам профессиональной ориентации и трудоустройства, а также получения дополнительной профессии, создаст кадровый резерв для предприятий региона, а молодежь будет участвовать в профессиональных конкурсах различной направленности»',
      news4: 'В состав команды вошли доцент кафедры "Коммерция и бизнес-информатика" Наталия Дюженкова, ответственный по учебно-методической работе Института энергетики, приборостроения и радиоэлектроники Сергей Баршутин, доценты кафедры "Технологические процессы, аппараты и техносферная безопасность" Андрей Степанов и Андрей Пахомов, старший преподаватель кафедры "Системы автоматизированной поддержки принятия решений" Виктория Конкина и специалисты отдела профориентационной подготовки Константин Тулупов и Дарья Милосердова. Участниками слета были педагогические работники различных образовательных учреждений области, всего более 150 человек.Спортивная часть мероприятия включала в себя соревнования по спортивному ориентированию, технике пешеходного и водного туризма, командные соревнования по спасательным работам в рамках пешеходного и водного туризма. В творческой программе соревнований были конкурс туристской песни, конкурс краеведов, конкурс фотографии, конкурс туристских навыков и быта. Команда ТГТУ показала хорошие результаты в конкурсной программе, заняв первое место в конкурсе фотографий и второе место в конкурсе краеведов и достойные результаты в спортивной программе: первое место в соревнованиях по спортивному ориентированию, второе место в соревнованиях по спасательным работам в технике пешеходного туризма, второе место в соревнованиях по технике пешеходного туризма, и в итоге заняла третье место в общекомандном зачете по спортивным видам.“Слет позволяет попробовать себя в чем-то новом, отличном от привычной жизни, а главное - это работа в команде, помощь и взаимовыручка!”, - отметила участник соревнований, доцент кафедры "Коммерция и бизнес-информатика" Наталия Дюженкова.',
      news5: 'В этом учебном году прощальный школьный звонок прозвенел для 42 выпускников. Для воспитанников лицея этот день стал особенным вдвойне. Ведь, покидая стены школы, они фактически прощаются с домом, в котором жили и учились два года.Поздравить выпускников пришел ректор ТГТУ Михаил Краснянский. Со словами поздравлений к ученикам также обратились Ирина Маренкова – директор Политехнического лицея ТГТУ, Ольга Исаева - замдиректора по учебно-воспитательной работе, администрация, педагоги и сотрудники лицея, родители обучающихся.«Политехнический лицей почти 30 лет находится в системе образования нашего университета. Сюда приходят ученики, в первую очередь ориентированные на инженерно-техническое образование. С ними работает наш профессорско-преподавательский состав, для них доступна вся наша материально-техническая база. У нас учатся замечательные ребята, активное участие они принимают не только в образовательной деятельности, но и в общественной, творческой жизни ТГТУ. Сегодня я от души поздравляю их с праздником Последнего звонка, поздравляю также их родителей и педагогов. Желаю ребятам успешной сдачи ЕГЭ и удачи в поступлении на желаемые направления подготовки!» - сказал ректор ТГТУ Михаил Краснянский.'
  };

  modalText.textContent = newsContent[newsId];
  modal.style.display = 'block';
  document.body.style.overflow = 'hidden';  // запрещает скролл страницы пока открыто модальное окно 
}

function closeModal() {
  const modal = document.getElementById('myModal');
  modal.style.display = 'none';
  document.body.style.overflow = '';  // разрешает скролл страницы 
}

window.onclick = function(event) {
  const modal = document.getElementById('myModal');
  if (event.target === modal) {
      closeModal();
  }
}

document.addEventListener('DOMContentLoaded', (event) => {
  setTimeout(showCookieConsent, 6000); // 60000 миллисекунд = 1 минута
});

function showCookieConsent() {
  if (!getCookie('cookiesAccepted')) {
      document.getElementById('cookieConsentModal').style.display = 'block';
  }
}

function acceptCookies() {
  setCookie('cookiesAccepted', 'true', 365);
  document.getElementById('cookieConsentModal').style.display = 'none';
}

function setCookie(name, value, days) {
  let expires = "";
  if (days) {
      let date = new Date();
      date.setTime(date.getTime() + (days*24*60*60*1000));
      expires = "; expires=" + date.toUTCString();
  }
  document.cookie = name + "=" + (value || "") + expires + "; path=/";
}

function getCookie(name) {
  let nameEQ = name + "=";
  let ca = document.cookie.split(';');
  for(let i=0; i < ca.length; i++) {
      let c = ca[i];
      while (c.charAt(0) == ' ') c = c.substring(1,c.length);
      if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length,c.length);
  }
  return null;
}